z-mnp-test/misc/ClhWsNPCWebServiceDr/NPCWebServiceSoap12Binding/processNPCMsg/MIW_OM_1002.xml

<?xml version="1.0" encoding="UTF-8"?>
<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.clearinghouse.com">
   <soap:Header/>
   <soap:Body>
      <ws:processNPCMsg>
         <ws:userId>mnpCatTest</ws:userId>
         <ws:password>bW5wQ2xoVGVzdDIwMTE=</ws:password>
         <ws:xmlMsg><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?><NPCMessageData>
    <NPCData>
        <MessageHeader>
            <PortType>1</PortType>
            <MessageID>1002</MessageID>
            <SoapRequestId>101</SoapRequestId>
            <MessageCreateTimeStamp>20160928101600</MessageCreateTimeStamp>
            <Sender>CRDB</Sender>
            <Receiver>CATCDMA</Receiver>
        </MessageHeader>
        <NPCMessages>
            <PortRequestAck>
                <ProcessType>1</ProcessType>
                <OrderId>021708291131368</OrderId>
                <OrderDate>20171011100041</OrderDate>
                <ValidationDeadline>20171012142654</ValidationDeadline>
                <Zone>1</Zone>
                <Donor>AWN</Donor>
                <Recipient>CATCDMA</Recipient>
                <OperatorCode>02</OperatorCode>
			<ChannelId>0200000</ChannelId>
                <NumberWithPinWithCLHFlag>
                    <MSISDN>0818437369</MSISDN>
                    <PinCode>12345678</PinCode>
                    <PortId>20171011CATCDMA0000002</PortId>
                    <CLHAccepted>1</CLHAccepted>
				<CLHRejectCode>1</CLHRejectCode>
                </NumberWithPinWithCLHFlag>
                <SubscriberData>
                    <SubscriberId>1111</SubscriberId>
                    <Remark>aaa</Remark>
                </SubscriberData>
            </PortRequestAck>
        </NPCMessages>
        <MessageFooter>
            <Checksum>1</Checksum>
        </MessageFooter>
    </NPCData>
</NPCMessageData>
         ]]></ws:xmlMsg>
      </ws:processNPCMsg>
   </soap:Body>
</soap:Envelope>